from googletrans import Translator

translator = Translator()

# Зчитати текстовий файл
with open("my_favorite_game.txt", "r", encoding="utf-8") as file:
    original_text = file.read()

# Отримати переклад
translated_text = translator.translate(original_text, src="uk", dest="en").text

# Вивести переклад
print(translated_text)
# Записати розповідь у текстовий файл
story = """Моя улюблена гра - це шахи. Це гра стратегії та інтелекту, яка завжди залишає мене в захопленні. 
Кожен хід вимагає від мене розглядання багатьох варіантів та передбачення можливих ходів супротивника. 
Шахи навчили мене концентрації, логічному мисленню та вмінню приймати важливі рішення.

Один із моїх найнезабутніших моментів у грі став той, коли я зробив вдалий гамбіт, відкриваючи нові можливості для атаки. 
Гра в шахи завжди наповнює мої дні викликами та радістю від кожної перемоги, чи навіть від вивчення поразок.

Ця гра виробляє в мені стратегічний спосіб мислення та вчить важливості планування. 
Шахи - це не просто гра, це виклик для розуму, який надає безмежний простір для вдосконалення."""

# Записати у текстовий файл
with open("my_favorite_game.txt", "w", encoding="utf-8") as file:
    file.write(story)
